[
  {
    "name": "The Nexus of Higher Studies: Opportunities Abroad",
    "description": "The session will mainly concentrate on the application process, necessary preparations, and the academic and cultural adjustments required for studying abroad. The session seamlessly blend practical information with personal anecdotes and cover practical tips, essential skills, and opportunities for studying abroad.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/WORKSHOPS/Nexus%20.png",
    "date": "6th August 2024",
    "time": "10:00 AM - 11:40 PM",
    "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
    "fee": "Rs 250",
    "topics": [
      "Explore Key Subject and Essential skills to Excel in Higher Education Pathway, with Special Focus on Oppurtunities in Cannada andn Ireland."
    ],
    "speakers": [
      {
        "name": "Preethi Raghuraman",
        "title": "Master of Data Science and Artificial Intelligence"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLScRNJaP-P_KRVTcxnqn0EeyUjjLtYIOk9kaKFXh_1DzTD3CQQ/closedform"
  },
   {
    "name": "data analysis",
    "description": "This session will set one’s sight on participants who will be taught data analysis, visualization tools, and how to make informed decisions. This seminar will emphasize both fundamental and advanced aspects of data analysis. The participants will be guided through various data analysis tools, including Jupyter Notebook, Google Colab, Power BI, and Tableau.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/WORKSHOPS/data%20analysis.png",
    "date": "6th August 2024",
    "time": "10:00 AM - 11:40 PM",
    "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
    "fee": "Rs 250",
    "topics": [
      "TABLEU.",
      "DATA ANALYSIS",
      "IN-DEPTH UNDERSTANDING OF BIG DATA"
    ],
    "speakers": [
      {
        "name": "Preethi Raghuraman",
        "title": "Master of Data Science and Artificial Intelligence"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLScRNJaP-P_KRVTcxnqn0EeyUjjLtYIOk9kaKFXh_1DzTD3CQQ/closedform"
  },
  {
    "name": "INVENTUS",
    "description": "Showcase your innovation in our Hackathon, where your final project doesn't just win but earns a patent. Turn your groundbreaking ideas into intellectual property that makes an impact. Collaborate, create, and leave with a project that could shape the future.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/TECHNICAL/tech4.png",
    "date": "26th-27th September 2024",
    "time": "Day 1: 10:00 AM - 11:00 AM, Day 2: 12:00 PM - 02:00 PM",
    "venue": "TBA",
    "fee": "₹180/- for a team of 3 participants",
    "rules": [
      "The hackathon is open to all students. Participants can join individually or form teams of up to 4 members. Registration is required before the deadline.",
      "Participants must register online, submitting team names and member details. Any team member changes after registration must be communicated to the organizers.",
      "The hackathon lasts 12 hours, with a theme announced at the start. Participants must develop projects based on the theme and present them to judges.",
      "Integrity and honesty are required. Plagiarism, copying code, or unauthorized assistance will lead to immediate disqualification.",
      "All projects must be submitted within the designated time frame through the provided platform. Functional projects meeting specified requirements are necessary for evaluation.",
      "Projects will be evaluated on innovation, functionality, technical implementation, potential impact, and the quality of the presentation.",
      "The winning project may be eligible for a patent, and top teams will receive cash prizes. All participants will get certificates of participation.",
      "Teams can be disqualified for submitting copied code, disruptive behavior, or violating any event rules. Participants must bring their own hardware and adhere to the schedule."
    ],
    "contactPerson": [
      {
        "name": "Gadipelly Sandeep Kumar",
        "phone": "+91 9963787818"
      },
      {
        "name": "Kunal Meshram",
        "phone": "+91 9755365169"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSfnbH3wUHDQ-wU-i7kG0WDbPyTdeNjtb7eyXRpufkjVgVrwzQ/viewform"
  },
  {
    "name": "Code Quest",
    "description": "CodeQuest is an adventure-themed quiz where participants embark on a journey through various realms of computer science and engineering. Each realm represents a different technical domain, and participants must answer questions to unlock the next realm and ultimately complete their quest.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/TECHNICAL/tech1.png",
    "date": "26th September 2024",
    "time": "09:00 AM - 03:00 PM",
    "venue": "TBA",
    "fee": "₹120/- for a team of 2 participants, ₹180/- for a team of 3 participants, ₹220/- for a team of 4 participants",
    "rules": [
      "The event is open to all students, allowing teams of two to four members.",
      "The event will be offline with three coding rounds: Fill In The Blanks, error spotting, and Problem Solving for a problem statement.",
      "Participants must bring their laptops and adhere to time limits for each round, with increasing difficulty in problems across rounds.",
      "Plagiarism, code copying, or seeking unauthorized help is strictly prohibited, leading to immediate disqualification.",
      "Problem statements for each round will be provided, and participants must use specified programming languages to solve them.",
      "Submissions must be error-free and submitted through the designated platform. Late submissions are only accepted for organizer-acknowledged technical issues.",
      "Solutions are judged based on correctness, efficiency, code readability, and innovation, with bonus points for optimized solutions."
    ],
    "contactPerson": [
      {
        "name": "Srijan Mani Tripathi",
        "phone": "+91 7903385276"
      },
      {
        "name": "Athish Krithik JD",
        "phone": "+91 9500476719"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSfduxmprmtHD2WTKfm0G1iQ6_gTRz6AuW7IgIVpZniTmA1eaw/viewform"
  },
  {
    "name": "Block and Brawl",
    "description": "It is a two-round event blending strategic block and tackle techniques with high-stakes debate. Level 1 features and tactical challenges, while Level 2 focuses on applying strategies in competitive debates. Join us for an exciting blend of strategy, rhetoric, and networking.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/NON-TECHNICAL/nontech1.png",
    "date": "27th September 2024",
    "time": "10:00 A.M. - 01:00 P.M.",
    "venue": "TBA",
    "fee": "₹75/- for individual",
    "rules": [
      "The topic is announced at the start of the debate. Participants may be given a few minutes to prepare their thoughts.",
      "Participants must argue both 'for' and 'against' the given topic. The moderator will signal when to switch sides. The participant must immediately switch their stance and continue the debate from the opposite perspective.",
      "Each side (for/against) is given a specific time to present their arguments, usually 30 seconds to 2 minutes per switch. The total time for the debate is also predetermined, typically around 5-10 minutes.",
      "The moderator can call for a switch anytime. The number of switches is usually not fixed, adding an element of unpredictability. Participants must be prepared to switch their stance quickly and seamlessly.",
      "Arguments should be clear, concise, and relevant. Participants should avoid repetition and instead provide new points with each switch.",
      "Participants must maintain decorum and show respect for the opposing side's arguments. Interrupting or talking over the moderator or opponent is generally discouraged.",
      "Clarity, fluency, and confidence in presenting arguments. Adaptability: Ability to switch sides quickly and effectively.",
      "Keeping the audience and judges engaged through compelling arguments."
    ],
    "rounds": {
      "Round 1": [
        "All participants present their arguments on a given topic, with judges shortlisting the top contenders based on their reasoning, clarity, and ability to engage the audience."
      ],
      "Round 2": [
        "Only those who impress in this initial stage move forward to Round 2, where the real challenge begins."
      ],
      "Final Round": [
        "This final round determines the winners as the remaining debaters face off, switching sides and arguing both for and against the topic with agility when the command 'switch' is given."
      ]
    },
    "contactPerson": [
      {
        "name": "Archana Ramesh",
        "phone": "+91 7845836356"
      },
      {
        "name": "Dhiyaan Kumaar Ms",
        "phone": "+91 9445291303"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSf_LqAg-oTmaaV7rWDavFb8X7xZkWRt_NI5Wd7GBKmbWtWzAg/viewform"
  },
  {
  "name": "Dev Fusion",
  "description": "Dev Fusion, the ultimate platform for innovators and tech enthusiasts! This hackathon is not just about competition; it’s about creating groundbreaking technology for the greater good. This unique event allows participants to earn recognition for SRM IST by developing solutions that could shape the future. Whether your interests lie in AI, machine learning, IoT, or any other cutting-edge technology, Dev Fusion is where your ideas come to life. Participants are encouraged to create web apps, Android apps, iOS apps, APIs, or any software that addresses real-life problems.",
  "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/TECHNICAL/tech2.png",
  "date": "27th September 2024",
  "time": "01.00 P.M. - 04.00 P.M.",
  "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
  "fee": "₹120/- for a team of 2 participants, ₹180/- for a team of 3 participants, ₹220/- for a team of 4 participants",
  "rules": [
    "Each team must consist of 2-4 members.",
    "Participants are requested to bring their laptops or systems. Replit or GitHub Code spaces are provided as alternatives, and participants can also use online compilers or IDEs.",
    "The competition consists of three rounds designed to test various coding and problem-solving skills:\nRound 1: Quiz\nRound 2: Using Developer Skills to Build Something Useful and Innovative\nRound 3: Demonstrating the Application and Submitting a PDF with a Description of the App, including the Technology Used and the Role of AI, if applicable.",
    "Each round will have a time limit and specific objectives, and all submissions must be made through the designated platform.",
    "Participants must not seek or provide unauthorized assistance during the event.",
    "Solutions will be judged based on correctness, efficiency (time and space complexity), and code readability.",
    "Prizes will be awarded to the top three teams/individuals and certificates to all participants.",
    "Teams that submit copied code or use any AI tools will be disqualified instantly from the competition.",
    "Any violation of these rules will result in immediate disqualification."
  ],
  "contactPerson": [
    {
      "name": "Vibhu Sahu",
      "phone": "+91 93400 89039"
    },
    {
      "name": "T.N. Shreya",
      "phone": "+91 7200144006"
    }
  ],
  "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSf0RfJg7M90jJBpA7mnqcHquBHFpWZNZg0UCjOBqij8t41QbQ/viewform"
},
  {
  "name": "FIFA",
  "description": "Get ready to kick off an unforgettable experience with the Ultimate Football Showdown! Join us for a thrilling online football tournament that brings the excitement of the pitch right to your screen. Whether you're a seasoned pro or just looking for some football fun, this event is your gateway to glory!",
  "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/GAMING/gaming2.png",
  "date": "26th September 2024",
  "time": "11.00 A.M. - 2.00 P.M.",
  "fee": "₹120/- for a team of 2 participants",
  "rules": [
    "A player's team should comprise of 2 members only. Time for each match is 5 minutes.",
    "Each team must score more goals than their opponents.",
    "If both teams have an equal number of goals, then penalty shootouts will occur.",
    "During penalty shootouts, the team that scores first will secure victory and is our winner, while the other team is our runner-up.",
    "Each match will follow a best-of-three or knockout format, and opponent selection will be determined using the round-robin method.",
    "Hacks or any other suspicious activity will lead to disqualification of the team.",
    "Physical presence of the team is required for this game.",
    "There will be a first prize and second prize."
  ],
  "contactPerson": [
    {
      "name": "Sarthak Agarwal",
      "phone": "+91 8299426750"
    },
    {
      "name": "Md Auranzeb Khan",
      "phone": "+91 7003867238"
    }
  ],
  "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSdXW7fJ9rCQ0esPhoagD4_aRRvq2GAoasFZ4aYG3T1TwCZwIA/viewform"
},
  {
  "name": "Generative AI by Nxtwave",
  "description": "Learn how to craft the right questions or instructions to guide AI models, especially Large Language Models (LLMs), to produce desired outcomes with our Hands-on Workshop on - 'AI Nexus'!",
  "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/WORKSHOPS/generative_ai.png",
  "date": "19 September 2024",
  "time": "09.00 am - 3.00 pm",
  "registrationFee": "₹250",
  "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
  "resourcePersons": [
    {
      "name": "MRS. Sarvani",
      "designation": "Scientist - E"
    }
  ],
  "topicsCovered": [
    "Introduction",
    "Why AI",
    "How AI Works",
    "Techniques Of AI",
    "Implementation Of Generative AI",
    "Applications and Models",
    "Risk And Misuses",
    "LLM Implementation",
    "Introduction To NLP",
    "Working Of NLP"
  ],
  "contactPerson": [
    {
      "name": "Bhuvanesh S",
      "phone": "+91 6380953383"
    }
  ],
  "registrationLink": "https://forms.gle/BpXZhQoXomUzdcUd6"
},
  {
  "name": "IDEATE X CHANGE",
  "description": "Unleash your persuasive prowess in IdeateXchange: Tech Debate Edition, where words are your most potent weapons. Participants will face off in a spirited debate, either supporting or opposing a given topic. It’s a test of quick thinking, clear articulation, and the power to persuade. An Adjudicator will oversee the proceedings and determine the winner based on the strength of arguments, rebuttals, and overall delivery.",
  "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/TECHNICAL/tech3.png",
  "date": "26th September 2024",
  "time": "09.00 A.M. - 03.00 P.M",
  "fee": "₹100/- for an individual ₹130/- for a team of 2 participants",
  "venue": "SRM IST VDP",
  "rules": [
    "Each team consists of two participants.",
    "The participants will be provided with topics.",
    "The teams will be divided into two sides, one supporting it and the other negating it.",
    "Each team will be given chances to talk based on recognition.",
    "Each team will subsequently get alternative chances to speak.",
    "Speakers will be judged based on how many turns they take to speak, the duration & the points they put forth, and scores will be marked based on the same.",
    "Participants must maintain decorum and respect the adjudicator, the event coordinators, and fellow participants.",
    "The use of offensive language or personal attacks is strictly prohibited.",
    "Topics Covered - " ,
    "1. Will Autonomous Robots Replace Human Workers in All Industries?",
    "2. Is Blockchain the Future of Secure Data Transmission?",
    "3. Are RISC (Reduced Instruction Set Computing) Architectures Superior to CISC (Complex Instruction Set Computing)?",
    "4. Will Quantum Computing Replace Classical Computing in the foreseeable future?",
    "5. Should Software Engineers Be Legally Liable for Software Failures?",
    "6. Super/Quantum computers - a boon or bane?"
  ],
  "contactPerson": [
    {
      "name": "Eswar D",
      "phone": "+91 7604913994"
    },
    {
      "name": "Madhumithaa P",
      "phone": "+91 9790245467"
    }
  ],
  "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSexvz8RhziPNQ99mwerbwCPKVfWLoJC6HcFdYdQgpyDZDOabA/viewform"
},
 {
    "name": "INTERVIEW EDGE",
    "description": "Enhance your interview abilities and boost your self-confidence with an interview simulator. You can practice answering various questions and receive instant feedback to refine your responses. Furthermore, mock interviews provide invaluable experience, allowing participants to gain confidence and learn how to manage constructive criticism effectively.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/NON-TECHNICAL/nontech2.png",
    "date": "26th September 2024",
    "time": "10.00 A.M. - 02.00 P.M.",
    "venue": "SRM IST VDP",
    "fee": "₹75/- for an individual",
    "rules": [
      "Each participant must be present at the venue until the end to avail OD.",
      "Points are awarded for successfully answering interview questions or completing challenges. No partial scoring will be given.",
      "The participant with the most points at the end of the interview wins.",
      "The student coordinators have the final decision-making authority.",
      "Those who win the first and second place get exciting prizes!!"
    ],
    "contactPerson": [
      {
        "name": "J Joshua Haniel",
        "phone": "+91 9940263285"
      },
      {
        "name": "Nilesh J",
        "phone": "+91 9043795180"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSetCEGyfyCUdKGlX6tRJXEDuxLN1B17G2MmtYLr_9-r1XpJBw/viewform"
  },
  {
    "name": "IPL Auction",
    "description": "A fun team event, it is a simulation of the real-life IPL auction where the participants pick a team of 11. The participants have to pick a strong team with their knowledge about the players. They will be given an initial budget based on which the participants are expected to choose the team.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/NON-TECHNICAL/nontech3.png",
    "date": "26th September 2024",
    "time": "10.00 A.M. - 01.00 P.M.",
    "venue": "SRM IST VDP",
    "fee": "₹120/- for a team of 2 participants, ₹180/- for a team of 3 participants",
    "rules": [
      "A team must consist of 2 or 3 participants per team.",
      "Any decisions made are final and binding.",
      "Quiz - The quiz will be conducted using the Kahoot app with 20 questions.",
      "The top 10 scorers in the quiz will proceed to Round 2.",
      "The top 3 teams in the quiz round will get an additional bonus going into the auction.",
      "IPL Auction - Each team will be allocated a fixed budget of 80 crores for the auction. The objective is to build a team of 11 players. Failure to do so will result in immediate disqualification.",
      "Every team can contain a maximum of 4 foreign players, at least 1 wicket keeper, and 1 uncapped players.",
      "Players are categorized into six groups: capped Indian batsmen, capped Indian bowlers, capped Indian all-rounders, capped Indian wicket keepers, all uncapped players, and all overseas players."
    ],
    "contactPerson": [
      {
        "name": "TS Vijay",
        "phone": "+91 7305334679"
      },
      {
        "name": "Ashwin K",
        "phone": "+91 9884756578"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSfbSrewEG0kbOqmTiu8ec_RjyUdFBOTB_6EJovQPd4VKNPFFQ/viewform"
  },
  {
    "name": "LEVEL X",
    "description": "The challenge blends creativity, innovation, and technical skills as contestants use Python, Java, Pygame, and Unity to develop a new-level design. Before the competition, event coordinators will provide the initial game code and a detailed explanation, ensuring everyone starts on equal footing. What makes LEVEL X special is its blend of fun, nostalgia, and learning it offers. As participants work on their levels, they'll revisit classic gaming elements while innovating with modern techniques. The event is a great way to hone problem-solving skills in a playful and competitive environment. The most innovative and well-executed level design will take the top prize, making it a thrilling challenge for coders of all levels.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/TECHNICAL/tech5.png",
    "date": "27th September 2024",
    "time": "09.00 A.M. - 03.00 P.M",
    "venue": "Auditorium",
    "fee": "₹130/- for a team of 2 participants",
    "rules": [
      "A team can consist of up to 2-4 participants and a team name should be provided.",
      "Participants have exactly 4 hours to complete their level design. Once the time limit exceeds, the page given for coding will close automatically.",
      "The initial game code provided by event coordinators must be used as the foundation for the level design. Modifications to this code are allowed, but the base structure should remain recognizable.",
      "Participants can use online resources like documentation and tutorials during the competition. However, direct copying of code from external sources is not allowed.",
      "Plagiarism or using pre-existing designs will result in disqualification.",
      "Levels will be judged based on creativity, innovation, technical execution, and overall gameplay experience. The organizing committee reserves the right to make the final decision."
    ],
    "contactPerson": [
      {
        "name": "Saranya Purushothaman",
        "phone": "+91 7305708933"
      },
      {
        "name": "Y.Sai Dheeraj",
        "phone": "+91 7395961001"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSdmpDfYolFuq-77t8WX1mlm-Z79p1XM_tSjuyqq6pV1Eh6LLQ/viewform"
  },
  {
    "name": "MARKET MANIA",
    "description": "In this Event anyone who wants to gain knowledge about the stock market and wants to check your knowledge about stocks and showcase it to others. You can participate in this event. In this event we will give you some amount to invest and a companies list, you will have to invest Rs 30,000 and we will see some market crashes.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/TECHNICAL/tech6.png",
    "date": "26th September 2024",
    "time": "09.00 A.M. - 03.00 P.M",
    "venue": "CW305, 3rd Floor , SRM UNIVERSITY VADAPALANI C BLOCK",
    "fee": "₹120/- for a team of 2 participants and 180 for a team of 3 participants",
    "rules": [
      "Open to students, with teams of 2 or 3 members. All participants must register online before the deadline, and team changes must be notified to the organizers.",
      "The event is offline and consists of 5 rounds of testing stock market knowledge. Participants can bring laptops, and each round focuses on different investment strategies.",
      "Teams start with Rs.30,000. A maximum of Rs.5,000 can be invested in each company at any time. Investment forms cannot be resubmitted once filled.",
      "Clues will be presented through PPTs at set intervals, influencing stock prices and helping teams adjust their buy, sell, or hold decisions.",
      "Participants must maintain integrity. External strategies, plagiarism, or unauthorized assistance will lead to immediate disqualification.",
      "Teams will be judged on total portfolio value and strategic decision-making. The judges' decisions are final and binding.",
      "Disruptive behavior, rule violations, or failure to adhere to time limits can result in disqualification.",
      "Teams must submit their investments via Google Forms/Website during each round and ensure their trading setup is ready before the event begins.",
      "Full Details And Regulations - https://docs.google.com/document/d/16JYsxeu5JuDTw1iP1lHuLDQtj3S68xAM67eT0XQkZ1A/edit?usp=sharing "
    ],
    "contactPerson": [
      {
        "name": "Eklavya Singh",
        "phone": "+91 7668291228"
      },
      {
        "name": "A George",
        "phone": "+91 9962762492"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSeK-EQpuVzOnjfQmXbxrrG07fGeL4yh0AZ4eeLOu7JJMSB4PA/viewform"
  },
  {
    "name": "MINES",
    "description": "\"Real-Life Mines\" is a strategic outdoor game played on a large grid marked on the ground. Players take turns stepping on squares, trying to avoid hidden \"mines\" placed by the organizers. Each safe step allows them to continue, but stepping on a mine costs them one of their two lives. Losing both lives means the team is out of the game. The challenge is to navigate as many safe squares as possible, balancing risk and strategy to avoid the hidden dangers.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/NON-TECHNICAL/nontech4.png",
    "date": "27th September 2024",
    "time": "10.00 A.M. - 01.00 P.M.",
    "venue": "Auditorium",
    "fee": "₹120/- for a team of 2 participants, ₹180/- for a team of 3 participants",
    "rules": [
      "A team can consist of 2-3 participants.",
      "Each participant or team must have a unique identifier or team name.",
      "Punctuality is mandatory.",
      "During the game, one participant must be on the minefield and the other participants of the team must stay outside and guide them to make the next step.",
      "Each team will be provided with a blank paper simulating the minefield to track the locations of mines, record player moves, and plan their logical strategies.",
      "Teams earn points for landing on a safe block or flagging a mine.",
      "The time limit to make each move will be 50 seconds, and points will be deducted if failed to do so.",
      "Each team would be given 2 lives, and each life would be lost when landed on a mine.",
      "A hint can be obtained by answering a question or deducing a riddle.",
      "The team with the most points wins."
    ],
    "contactPerson": [
      {
        "name": "Pratham Mehta",
        "phone": "+91 6353262649"
      },
      {
        "name": "Caroline Vineeta S L",
        "phone": "+91 7338999541"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSdV9RexFdgh2-aVkV7kDYYYjAa32dniB80_6uBT0jJGNKwaEA/viewform"
  },
  {
    "name": "SHERLOCKED!",
    "description": "Unleash your detective skills in a fast-paced mystery-solving competition. Teams will race to solve a series of clues, puzzles, and interact with characters to crack the case.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/GAMING/gaming3.png",
    "date": "27th September 2024",
    "time": "11.00 A.M. - 02.00 P.M.",
    "venue": "Offline",
    "fee": "₹200/- for a team of 4 participants",
    "rules": [
      "Each team must have 4 members.",
      "This is a Single round event.",
      "Teams must solve clues sequentially to advance.",
      "The first team to solve the mystery or the team with the most progress wins.",
      "No sabotage or collaboration with other teams is allowed.",
      "Breaking rules or tampering with clues results in penalties.",
      "Only notebooks and pens are allowed.",
      "Hints available at checkpoints with time penalties."
    ],
    "contactPerson": [
      {
        "name": "Rishabh Roy Choudhury",
        "phone": "+91 9884832976"
      },
      {
        "name": "B Madhav Sai",
        "phone": "+91 7306512345"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLScjxJr5YOJKuH-_p43U40LbI5Qa_GGL9jNUJyKyq_RSBNUQ1g/viewform"
  },
  {
    "name": "Tech Catalyst",
    "description": "A 'Tech Catalyst' event is a competition where teams work together to solve a given problem using a dataset provided by the organizers. The goal is to analyze the data, draw insights, or make predictions based on what they find. Participants will use tools like Excel, PowerPoint, Tableau, or Power BI to visualize their results and present their solutions. The focus is on how creatively and effectively teams can apply data science techniques to address the problem. Overall, the event encourages teams to think critically and use the data to develop meaningful solutions.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/TECHNICAL/tech7.png",
    "date": "27th September 2024",
    "time": "09.00 A.M. - 03.00 P.M.",
    "venue": "SRM IST VDP",
    "fee": "₹180/- for a team of 3 participants",
    "rules": [
      "Teams must consist of 3 members, with all members encouraged to contribute equally to the tasks.",
      "Only the dataset provided by the organizers is allowed. Teams must use this data for analysis and solutions.",
      "Teams are encouraged to creatively analyze and manipulate the dataset using the tools provided, such as Excel and Power BI.",
      "Participants can only use Excel, Power BI, Tableau, and PowerPoint for data analysis, visualization, and presentation.",
      "The use of any other software or programming languages beyond the permitted tools is not allowed.",
      "Final presentation files (PowerPoint, Excel, and Power BI) must be submitted by the deadline specified by the organizers.",
      "Judges will evaluate the precision and correctness of the team's findings.",
      "Solutions will be judged based on their creativity and how applicable they are in real-world scenarios."
    ],
    "contactPerson": [
      {
        "name": "Sharavana Ragav S",
        "phone": "+91 8148394601"
      },
      {
        "name": "S.R.Keerttna",
        "phone": "+91 9080589716"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSeEJ6gv53gcggmRin09ix-FDFSqyP3TcYPcPRMXCayDLRMySA/viewform"
  },
  {
    "name": "Techflix",
    "description": "Techflix is an exciting event designed to showcase innovative short films that explore tech, editing and filmmaking skills. It's your chance to shine and share your awesome breakthroughs with technology and make it Tech-tastic Film. Make sure to add some Drama to your short film and make it engaging. We're looking for tech-films that make complex ideas fun and interesting by engagingly blending education and entertainment!",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/NON-TECHNICAL/nontech5.png",
    "date": "26th-27th September 2024",
    "time": "Day 1: 10:00 AM - 11:00 AM, Day 2: 12:00 PM - 02:00 PM",
    "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
    "fee": "₹180 for a team of 2 participants, ₹200 for a team of 3 participants",
    "rules": [
      "A team must consist of a minimum of 3 and a maximum of 4 participants.",
      "Make sure to give your team a unique name!",
      "The duration of the video should be a minimum of 5 minutes and a maximum of 7 minutes.",
      "Since it's a non-technical event, you can include anything you like, but it must contain some technical aspects.",
      "You cannot use internet film layouts, the film should reflect your creativity and showcase your editing skills.",
      "You must submit your film before the deadline. Late submissions will not be entertained.",
      "The shooting of your film can be done anywhere.",
      "Your short film must follow the theme. If it does not, your team will be disqualified.",
      "Strictly no vulgarity or inappropriate scenes will be allowed in the video. Teams with such content will be disqualified."
    ],
    "contactPerson": [
      {
        "name": "Vaasavi G",
        "phone": "+91 6382941735"
      },
      {
        "name": "Irram Fatima",
        "phone": "+91 8925703367"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSesQPAZXFO_5-ES2jSiXYwkFuxZWHEiY0UbPcnwKoYtveEzcA/viewform"
  },
  {
    "name": "Trivia Trek",
    "description": "Are you a fan of web series and movies? Then Trivia Trek is your perfect match! This exciting quiz features multiple rounds like Connections, Guess the Song, and a classic Quiz Round, all designed to test your fandom knowledge. Whether you're competing solo or with a team, Trivia Trek offers a fun and challenging experience across your favorite genres. Join us and see if you can conquer the fandom universe!",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/NON-TECHNICAL/nontech6.png",
    "date": "26th September 2024",
    "time": "09:00 AM - 02:00 PM",
    "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
    "fee": "₹120 for a team of 2 participants, ₹180 for a team of 3 participants",
    "rules": [
      "A team can consist of 2 to 3 members.",
      "Each participant or team must have a unique identifier or team name.",
      "In the event of a tie, a rapid-fire round will determine the winner.",
      "No use of external help or electronic devices during the quiz (e.g., smartphones, smart watches).",
      "Prizes will be awarded to the top two teams.",
      "Any changes to team members must be notified to the organizers before the event begins.",
      "Participants must attend every round. By the end of the third round, the winners will be selected."
    ],
    "contactPerson": [
      {
        "name": "Jalanika R R",
        "phone": "+91 9087299370"
      },
      {
        "name": "Surya Sivakumar",
        "phone": "+91 7603970727"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSfx5MoWCef5uOtrOberiuehCJWwgLDWNQUpECskBWLnvZLbjQ/viewform"
  },
  {
    "name": "VALORANT Gaming Event",
    "description": "Prepare for the ultimate test of strategy, skill, and teamwork at the Valorant Gaming Event! Dive into the action-packed world of Valorant, where the best teams and players will face off in a high-stakes competition for glory. With fast-paced gameplay, strategic decision-making, and precise aim, every match promises intense battles and unforgettable moments.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/GAMING/gaming4.png",
    "date": "26th September 2024",
    "time": "11:00 A.M. - 02:00 P.M.",
    "venue": "SRM IST VDP",
    "fee": "₹300 for a team of 5 participants",
    "rules": [
      "5v5, Competitive mode.",
      "Knockout stages, Best of 2 for playoffs, Best of 3 for finals.",
      "Maps: Ascent, Bind, Haven, Split, Icebox, Breeze, Fracture, Lotus, Pearl.",
      "Map Selection via Veto system.",
      "Valorant account Level 20+.",
      "Teams of 5 players (1 substitute allowed).",
      "2 tactical pauses per map (1 minute each).",
      "10-minute reconnection time, then substitute or play a man down.",
      "Cheating results in disqualification.",
      "All communication must be respectful."
    ],
    "contactPerson": [
      {
        "name": "Saranya Purushothaman",
        "phone": "+91 7305708933"
      },
      {
        "name": "Y.Sai Dheeraj",
        "phone": "+91 7395961001"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSc-0yXhqfkH7sB7r9GErpST6ckcXQPCIZxhK3Gket2jURHvdg/viewform"
  },
  {
    "name": "Vivid Vision: 2D Digital Art and Animation Contest",
    "description": "Join our 2D Digital Art and Animation Contest, where creativity meets technology! Participants will have the opportunity to showcase their artistic talents by creating 2D images or animations based on a unique given theme. This event offers hands-on experience with tools like Photoshop, GIMP, Aseprite, and Piskel, helping to build a standout digital art portfolio.",
    "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/NON-TECHNICAL/nontech7.png",
    "date": "26th September 2024",
    "time": "01:00 PM - 04:00 PM",
    "venue": "TBA",
    "fee": "₹125/- for an individual",
    "rules": [
      "Participants can only enter as a team of 2 to 3 members (maximum of 3 members). The theme will be announced at the start of the contest. Participants must create a 2D image or animation based on this theme.",
      "Participants are requested to bring their laptops for designing.",
      "Participants may use any 2D graphic design or animation software, such as Photoshop, GIMP, Aseprite, Piskel, Adobe Animate, etc.",
      "All entries must be original works created by the participants. Use of pre-made assets is not allowed.",
      "Results are evaluated based on Creativity and Originality, Artistic Skill, and Relevance to Theme.",
      "After completion of the design, the image or the animation has to be submitted along with an Explanatory write-up (50 to 60 words) on how they have approached the theme along with the software used by them.",
      "Animations can be made within the time range of 3 to 5 seconds.",
      "This will be a one-round event, and the winners will be chosen based on this round.",
      "This event will consist of only two winners."
    ],
    "contactPerson": [
      {
        "name": "Sai Shivaram L N",
        "phone": "+91 7010003985"
      },
      {
        "name": "Sandhya A",
        "phone": "+91 7550136662"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSeOVLXjQ3HIXXeKm4YnFhiEvZJHhueOJqRE1b7ewjp5RJR0cw/viewform"
  },
  {
  "name": "Vivid Vision: 2D Digital Art and Animation Contest",
  "description": "Join our 2D Digital Art and Animation Contest, where creativity meets technology! Participants will have the opportunity to showcase their artistic talents by creating 2D images or animations based on a unique given theme. This event is perfect for aspiring game developers, graphic designers, and digital artists looking to enhance their portfolios while gaining hands-on experience with industry-standard tools. Tools like Photoshop, GIMP, Aseprite, and Piskel will be used to build a standout digital art portfolio.",
  "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/NON-TECHNICAL/nontech7.png",
  "date": "26th September 2024",
  "time": "01:00 PM - 04:00 PM",
  "venue": "TBA",
  "fee": "₹125/- for an individual",
  "rules": [
    "Participants can only enter as a team of 2 to 3 members (maximum of 3 members). The theme will be announced at the start of the contest. Participants must create a 2D image or animation based on this theme.",
    "Participants are requested to bring their laptops for designing.",
    "Participants may use any 2D graphic design or animation software, such as Photoshop, GIMP, Aseprite, Piskel, Adobe Animate, etc.",
    "All entries must be original works created by the participants. Use of pre-made assets is not allowed.",
    "Results are evaluated based on Creativity and Originality, Artistic Skill, and Relevance to Theme.",
    "After completion of the design, the image or the animation has to be submitted along with an explanatory write-up (50 to 60 words) on how they have approached the theme and the software used.",
    "Animations can be made within the time range of 3 to 5 seconds.",
    "This will be a one-round event, and the winners will be chosen based on this round.",
    "This event will consist of only two winners."
  ],
  "themes": [
    "Post-Human Evolution: Illustrate the next stage of evolution after humans, focusing on how new life forms might look and behave.",
    "Anachronistic Future: Depict a future where past technologies or aesthetics have made a comeback, blending old and new in surprising ways.",
    "Cyberpunk Cityscapes: Neon-lit futuristic cities with towering skyscrapers, flying cars, and digital billboards."
  ],
  "contactPerson": [
    {
      "name": "Sai Shivaram L N",
      "phone": "+91 7010003985"
    },
    {
      "name": "Sandhya A",
      "phone": "+91 7550136662"
    }
  ],
  "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSeOVLXjQ3HIXXeKm4YnFhiEvZJHhueOJqRE1b7ewjp5RJR0cw/viewform"
},
  {
  "name": "Web Development: Building the Digital Frontier",
  "description": "This workshop will focus its attention on fundamental and advanced aspects of web development, including building websites using HTML, CSS, and popular frameworks such as React and Node.js. The participants will be guided through the process of building a functional website, providing hands-on experience with the tools and technologies involved.",
  "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/WORKSHOPS/web_develpment.png",
  "date": "10th October 2024",
  "time": "10:00 AM - 03:00 PM",
  "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
  "fee": "₹200",
  "rules": [
    "Participants must attend the event in person at the given venue.",
    "Basic knowledge of web development and networking is preferred.",
    "No external tools or software will be required beyond what is provided at the workshop.",
    "Participants are encouraged to bring laptops for hands-on learning, though it is not mandatory.",
    "Participants will have hands-on experience on html, css, js and making web app on their own."
  ],
  "resourcePersons": [
    {
      "name": "Anirudh K",
      "affiliation": "Comcast (Alumnus, SRMIST VDP)"
    }
  ],
  "contactPerson": [
    {
      "name": "Athulya S S",
      "phone": "+91 8939927354"
    },
    {
      "name": "L Adithi",
      "phone": "N/A"
    },
    {
      "name": "Jothishreyaa",
      "phone": "N/A"
    }
  ],
  "registrationLink": "https://forms.gle/kSNbssWFNmbANqtU7"
},
    {
      "name": "BGMI",
      "description": " BGMI is a popular online multiplayer video game that falls under the battle royale genre. This is a team event where participants can showcase their BGMI skills.",
      "image": "https://raw.githubusercontent.com/srmacevdp/assets/refs/heads/main/EVENT%20POSTER/GAMING/gaming1.png",
      "date": "27th September 2024",
      "time": "10:00 AM - 11:00 AM",
      "venue": "TBA",
      "fee": "₹120/- for a team of 2 participants \n₹180/- for a team of 3 participants \n₹200/- for a team of 4 participants",
      "rules": [
    "Each team must have an appointed team captain/team representative. Only t captain is allowed to communicate with the organisers before, during or after the matches.",
        
    "The tournament organiser may change without prior notice any of the rules and regulations which seem necessary to ensure the success of the tournament. The tournament organiser’s decision is final.",
        
    "Teams need to be at the venue 30 minutes prior to the designated match start time  for setup.The lobby will be created by the organisers.",
        
    "To avoid delays in the program of the event, delays caused by players (showing up late, leaving the tournament area without a stated reason, last-minute smoke or toilet break) will lead to sanctions for the entire team. 15 minutes and beyond  Game will be forfeited.",
        
    "All participants and team managers are required to uphold the highest standards of fair play and sportsmanship. Any misbehaviour, breaking of rules, cheating or hacking will lead to disqualification."
    ],
    "rounds": {
      "Round 1": [
        "One battle royale match, from which the top 4 teams will qualify for next round (TDM)."
      ],
      "Round 2": [
        "All the 4 selected teams will play 3 matches in (TDM) against their opponent, the team which wins 2 matches out of 3, are qualified for the finals."
      ],
      "Final Round": [
        "The finalists playing this round will have 5 matches (TDM), the team which wins 3 matches out of 5 will be considered as the Final winner."
      ]
    },
      "contactPerson": [
        {
          "name": "Abhishek M ",
          "phone": "+91 7559067389"
        },
        {
          "name": "Shravan Chumble",
          "phone": "+91 7823844791"
        }
      ],
      "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSeKrpI6kQeWq6TwF3gVpWme2zKsst_Ncgbj8wY0n6-B0j8EQg/viewform"
    }

   
]
