[
  {
    "name": "The Nexus of Higher Studies: Opportunities Abroad",
    "description": "Learn about opportunities for higher studies abroad in this two-day workshop.",
    "image": "event posters/workshops/Nexus.png",
    "date": "21st-22nd September 2023",
    "time": "09:00 AM - 03:00 PM",
    "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
    "fee": "Rs 250",
    "topics": [
      "Introduction To Prompt Engineering",
      "Why Prompt Engineering",
      "How Prompt Engineering Works?",
      "Techniques Of Prompt Engineering",
      "Implementation Of Prompt Engineering",
      "Applications and Models",
      "Risk And Misuses",
      "LLM Implementation",
      "Introduction To NLP",
      "Working Of NLP"
    ],
    "speakers": [
      {
        "name": "Mr. Prasanth Babu",
        "title": "Founder and CEO of Playwithbot"
      }
    ],
    "registrationLink": "https://forms.gle/BpXZhQoXomUzdcUd6"
  },
  {
    "name": "INVENTUS",
    "description": "Showcase your innovation in our Hackathon, where your final project doesn't just win but earns a patent. Turn your groundbreaking ideas into intellectual property that makes an impact. Collaborate, create, and leave with a project that could shape the future.",
    "image": "ubertech/event posters/Technical/inventus.jpg",
    "date": "26th-27th September 2024",
    "time": "Day 1: 10:00 AM - 11:00 AM, Day 2: 12:00 PM - 02:00 PM",
    "venue": "TBA",
    "fee": "₹180/- for a team of 3 participants",
    "rules": [
      "The hackathon is open to all students. Participants can join individually or form teams of up to 4 members. Registration is required before the deadline.",
      "Participants must register online, submitting team names and member details. Any team member changes after registration must be communicated to the organizers.",
      "The hackathon lasts 12 hours, with a theme announced at the start. Participants must develop projects based on the theme and present them to judges.",
      "Integrity and honesty are required. Plagiarism, copying code, or unauthorized assistance will lead to immediate disqualification.",
      "All projects must be submitted within the designated time frame through the provided platform. Functional projects meeting specified requirements are necessary for evaluation.",
      "Projects will be evaluated on innovation, functionality, technical implementation, potential impact, and the quality of the presentation.",
      "The winning project may be eligible for a patent, and top teams will receive cash prizes. All participants will get certificates of participation.",
      "Teams can be disqualified for submitting copied code, disruptive behavior, or violating any event rules. Participants must bring their own hardware and adhere to the schedule."
    ],
    "contactPerson": [
      {
        "name": "Gadipelly Sandeep Kumar",
        "phone": "+91 9963787818"
      },
      {
        "name": "Kunal Meshram",
        "phone": "+91 9755365169"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSfnbH3wUHDQ-wU-i7kG0WDbPyTdeNjtb7eyXRpufkjVgVrwzQ/viewform"
  },
  {
    "name": "Code Quest",
    "description": "CodeQuest is an adventure-themed quiz where participants embark on a journey through various realms of computer science and engineering. Each realm represents a different technical domain, and participants must answer questions to unlock the next realm and ultimately complete their quest.",
    "image": "event posters/Technical/Capture the flag UPDATED_.png",
    "date": "26th September 2024",
    "time": "09:00 AM - 03:00 PM",
    "venue": "TBA",
    "fee": "₹120/- for a team of 2 participants, ₹180/- for a team of 3 participants, ₹220/- for a team of 4 participants",
    "rules": [
      "The event is open to all students, allowing teams of two to four members.",
      "The event will be offline with three coding rounds: code completion, error spotting, and writing code for a problem statement.",
      "Participants must bring their laptops and adhere to time limits for each round, with increasing difficulty in problems across rounds.",
      "Plagiarism, code copying, or seeking unauthorized help is strictly prohibited, leading to immediate disqualification.",
      "Problem statements for each round will be provided, and participants must use specified programming languages to solve them.",
      "Submissions must be error-free and submitted through the designated platform. Late submissions are only accepted for organizer-acknowledged technical issues.",
      "Solutions are judged based on correctness, efficiency, code readability, and innovation, with bonus points for optimized solutions."
    ],
    "contactPerson": [
      {
        "name": "Srijan Mani Tripathi",
        "phone": "+91 7903385276"
      },
      {
        "name": "Athish Krithik JD",
        "phone": "+91 9500476719"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSfduxmprmtHD2WTKfm0G1iQ6_gTRz6AuW7IgIVpZniTmA1eaw/viewform"
  },
  {
    "name": "Block and Brawl",
    "description": "It is a two-round event blending strategic block and tackle techniques with high-stakes debate. Level 1 features and tactical challenges, while Level 2 focuses on applying strategies in competitive debates. Join us for an exciting blend of strategy, rhetoric, and networking.",
    "image": "event posters/Non-Technical/GuessTheWhisper.jpg",
    "date": "27th September 2024",
    "time": "10:00 A.M. - 01:00 P.M.",
    "venue": "TBA",
    "fee": "₹75/- for individual",
    "rules": [
      "The topic is announced at the start of the debate. Participants may be given a few minutes to prepare their thoughts.",
      "Participants must argue both 'for' and 'against' the given topic. The moderator will signal when to switch sides. The participant must immediately switch their stance and continue the debate from the opposite perspective.",
      "Each side (for/against) is given a specific time to present their arguments, usually 30 seconds to 2 minutes per switch. The total time for the debate is also predetermined, typically around 5-10 minutes.",
      "The moderator can call for a switch anytime. The number of switches is usually not fixed, adding an element of unpredictability. Participants must be prepared to switch their stance quickly and seamlessly.",
      "Arguments should be clear, concise, and relevant. Participants should avoid repetition and instead provide new points with each switch.",
      "Participants must maintain decorum and show respect for the opposing side's arguments. Interrupting or talking over the moderator or opponent is generally discouraged.",
      "Clarity, fluency, and confidence in presenting arguments. Adaptability: Ability to switch sides quickly and effectively.",
      "Keeping the audience and judges engaged through compelling arguments."
    ],
    "rounds": {
      "Round 1": [
        "All participants present their arguments on a given topic, with judges shortlisting the top contenders based on their reasoning, clarity, and ability to engage the audience."
      ],
      "Round 2": [
        "Only those who impress in this initial stage move forward to Round 2, where the real challenge begins."
      ],
      "Final Round": [
        "This final round determines the winners as the remaining debaters face off, switching sides and arguing both for and against the topic with agility when the command 'switch' is given."
      ]
    },
    "contactPerson": [
      {
        "name": "Archana Ramesh",
        "phone": "+91 7845836356"
      },
      {
        "name": "Dhiyaan Kumaar Ms",
        "phone": "+91 9445291303"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSf_LqAg-oTmaaV7rWDavFb8X7xZkWRt_NI5Wd7GBKmbWtWzAg/viewform"
  },
  {
    "name": "Decision Making Through Data Analysis",
    "description": "Join us for a hands-on workshop on decision making through data analysis, where you'll dive into practical techniques and tools used in data-driven decision-making.",
    "image": "event posters/workshops/data analysis.png",
    "date": "05th-06th October 2023",
    "time": "Day 1: 10.00 A.M. - 03.00 P.M., Day 2: 10.00 A.M. - 03.00 P.M.",
    "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
    "fee": "Rs 250",
    "topics": [
      "Introduction to Data Analysis",
      "Tools and Techniques",
      "Data Visualization",
      "Predictive Modeling",
      "Decision-Making Frameworks",
      "Case Studies"
    ],
    "speakers": [
      {
        "name": "Dr. Aarti Mehta",
        "title": "Data Scientist at TechVision"
      }
    ],
    "registrationLink": "https://forms.gle/abcd1234efgh5678"
  },
  {
  "name": "Dev Fusion",
  "description": "Dev Fusion, the ultimate platform for innovators and tech enthusiasts! This hackathon is not just about competition; it’s about creating groundbreaking technology for the greater good. This unique event allows participants to earn recognition for SRM IST by developing solutions that could shape the future. Whether your interests lie in AI, machine learning, IoT, or any other cutting-edge technology, Dev Fusion is where your ideas come to life. Participants are encouraged to create web apps, Android apps, iOS apps, APIs, or any software that addresses real-life problems.",
  "image": "event posters/Technical/Debugging (3).png",
  "date": "27th September 2024",
  "time": "01.00 P.M. - 04.00 P.M.",
  "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
  "fee": "₹120/- for a team of 2 participants, ₹180/- for a team of 3 participants, ₹220/- for a team of 4 participants",
  "rules": [
    "Each team must consist of 2-4 members.",
    "Participants are requested to bring their laptops or systems. Replit or GitHub Code spaces are provided as alternatives, and participants can also use online compilers or IDEs.",
    "The competition consists of three rounds designed to test various coding and problem-solving skills:\nRound 1: Quiz\nRound 2: Using Developer Skills to Build Something Useful and Innovative\nRound 3: Demonstrating the Application and Submitting a PDF with a Description of the App, including the Technology Used and the Role of AI, if applicable.",
    "Each round will have a time limit and specific objectives, and all submissions must be made through the designated platform.",
    "Participants must not seek or provide unauthorized assistance during the event.",
    "Solutions will be judged based on correctness, efficiency (time and space complexity), and code readability.",
    "Prizes will be awarded to the top three teams/individuals and certificates to all participants.",
    "Teams that submit copied code or use any AI tools will be disqualified instantly from the competition.",
    "Any violation of these rules will result in immediate disqualification."
  ],
  "contactPerson": [
    {
      "name": "Vibhu Sahu",
      "phone": "+91 93400 89039"
    },
    {
      "name": "T.N. Shreya",
      "phone": "+91 7200144006"
    }
  ],
  "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSf0RfJg7M90jJBpA7mnqcHquBHFpWZNZg0UCjOBqij8t41QbQ/viewform"
},
  {
  "name": "FIFA",
  "description": "Get ready to kick off an unforgettable experience with the Ultimate Football Showdown! Join us for a thrilling online football tournament that brings the excitement of the pitch right to your screen. Whether you're a seasoned pro or just looking for some football fun, this event is your gateway to glory!",
  "image": "event posters/Gaming/FIFA.png",
  "date": "26th September 2024",
  "time": "11.00 A.M. - 2.00 P.M.",
  "registrationFee": "₹120/- for a team of 2 participants",
  "rules": [
    "A player's team should comprise of 2 members only. Time for each match is 5 minutes.",
    "Each team must score more goals than their opponents.",
    "If both teams have an equal number of goals, then penalty shootouts will occur.",
    "During penalty shootouts, the team that scores first will secure victory and is our winner, while the other team is our runner-up.",
    "Each match will follow a best-of-three or knockout format, and opponent selection will be determined using the round-robin method.",
    "Hacks or any other suspicious activity will lead to disqualification of the team.",
    "Physical presence of the team is required for this game.",
    "There will be a first prize and second prize."
  ],
  "contactPerson": [
    {
      "name": "Sarthak Agarwal",
      "phone": "+91 8299426750"
    },
    {
      "name": "Md Auranzeb Khan",
      "phone": "+91 7003867238"
    }
  ],
  "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSdXW7fJ9rCQ0esPhoagD4_aRRvq2GAoasFZ4aYG3T1TwCZwIA/viewform"
},
  {
  "name": "Generative AI by Nxtwave",
  "description": "Learn how to craft the right questions or instructions to guide AI models, especially Large Language Models (LLMs), to produce desired outcomes with our Hands-on Workshop on - 'AI Nexus'!",
  "image": "event posters/workshops/generative_ai.png",
  "date": "19 September 2024",
  "time": "09.00 am - 3.00 pm",
  "registrationFee": "₹250",
  "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
  "resourcePersons": [
    {
      "name": "MRS. Sarvani",
      "designation": "Scientist - E"
    }
  ],
  "topicsCovered": [
    "Introduction",
    "Why AI",
    "How AI Works",
    "Techniques Of AI",
    "Implementation Of Generative AI",
    "Applications and Models",
    "Risk And Misuses",
    "LLM Implementation",
    "Introduction To NLP",
    "Working Of NLP"
  ],
  "contactPerson": [
    {
      "name": "Bhuvanesh S",
      "phone": "+91 6380953383"
    }
  ],
  "registrationLink": "https://forms.gle/BpXZhQoXomUzdcUd6"
},
  {
  "name": "IDEATE X CHANGE",
  "description": "Unleash your persuasive prowess in IdeateXchange: Tech Debate Edition, where words are your most potent weapons. Participants will face off in a spirited debate, either supporting or opposing a given topic. It’s a test of quick thinking, clear articulation, and the power to persuade. An Adjudicator will oversee the proceedings and determine the winner based on the strength of arguments, rebuttals, and overall delivery.",
  "image": "event posters/Technical/webapp new.png",
  "date": "26th September 2024",
  "time": "09.00 A.M. - 03.00 P.M",
  "registrationFee": "₹100/- for an individual, ₹130/- for a team of 2 participants",
  "venue": "SRM IST VDP",
  "rules": [
    "Each team consists of two participants.",
    "The participants will be provided with topics.",
    "The teams will be divided into two sides, one supporting it and the other negating it.",
    "Each team will be given chances to talk based on recognition.",
    "Each team will subsequently get alternative chances to speak.",
    "Speakers will be judged based on how many turns they take to speak, the duration & the points they put forth, and scores will be marked based on the same.",
    "Participants must maintain decorum and respect the adjudicator, the event coordinators, and fellow participants.",
    "The use of offensive language or personal attacks is strictly prohibited."
  ],
  "contactPerson": [
    {
      "name": "Eswar D",
      "phone": "+91 7604913994"
    },
    {
      "name": "Madhumithaa P",
      "phone": "+91 9790245467"
    }
  ],
  "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSexvz8RhziPNQ99mwerbwCPKVfWLoJC6HcFdYdQgpyDZDOabA/viewform"
},
  {
  "name": "INTERVIEW EDGE",
  "description": "Enhance your interview abilities and boost your self-confidence with an interview simulator. You can practice answering various questions and receive instant feedback to refine your responses. Furthermore, mock interviews provide invaluable experience, allowing participants to gain confidence and learn how to manage constructive criticism effectively.",
  "image": "event posters/Non-Technical/Aficianado.jpg",
  "date": "26th September 2024",
  "time": "01.00 P.M. - 03.00 P.M.",
  "registrationFee": "₹75/- for an individual",
  "venue": "SRM IST VDP",
  "rules": [
    "Each participant must be present at the venue until the end to avail OD.",
    "Points are awarded for successfully answering interview questions or completing challenges. No partial scoring will be given.",
    "The participant with the most points at the end of the interview wins.",
    "The student coordinators have the final decision-making authority.",
    "Those who win the first and second place get exciting prizes!!"
  ],
  "contactPerson": [
    {
      "name": "J Joshua Haniel",
      "phone": "+91 9940263285"
    },
    {
      "name": "Nilesh J",
      "phone": "+91 9043795180"
    }
  ],
  "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSexvz8RhziPNQ99mwerbwCPKVfWLoJC6HcFdYdQgpyDZDOabA/viewform"
}
]
