[
  {
    "name": "The Nexus of Higher Studies: Opportunities Abroad",
    "description": "Learn about opportunities for higher studies abroad in this two-day workshop.",
    "image": "event posters/workshops/Nexus.png",
    "date": "21st-22nd September 2023",
    "time": "09:00 AM - 03:00 PM",
    "venue": "NS Lab, 2nd Floor, C Block, SRM IST VDP",
    "fee": "Rs 250",
    "topics": [
      "Introduction To Prompt Engineering",
      "Why Prompt Engineering",
      "How Prompt Engineering Works?",
      "Techniques Of Prompt Engineering",
      "Implementation Of Prompt Engineering",
      "Applications and Models",
      "Risk And Misuses",
      "LLM Implementation",
      "Introduction To NLP",
      "Working Of NLP"
    ],
    "speakers": [
      {
        "name": "Mr. Prasanth Babu",
        "title": "Founder and CEO of Playwithbot"
      }
    ],
    "registrationLink": "https://forms.gle/BpXZhQoXomUzdcUd6"
  },
  {
    "name": "INVENTUS",
    "description": "Showcase your innovation in our Hackathon, where your final project doesn't just win but earns a patent. Turn your groundbreaking ideas into intellectual property that makes an impact. Collaborate, create, and leave with a project that could shape the future.",
    "image": "ubertech/event posters/Technical/inventus.jpg",
    "date": "26th-27th September 2024",
    "time": "Day 1: 10:00 AM - 11:00 AM, Day 2: 12:00 PM - 02:00 PM",
    "venue": "TBA",
    "fee": "₹180/- for a team of 3 participants",
    "rules": [
      "The hackathon is open to all students. Participants can join individually or form teams of up to 4 members. Registration is required before the deadline.",
      "Participants must register online, submitting team names and member details. Any team member changes after registration must be communicated to the organizers.",
      "The hackathon lasts 12 hours, with a theme announced at the start. Participants must develop projects based on the theme and present them to judges.",
      "Integrity and honesty are required. Plagiarism, copying code, or unauthorized assistance will lead to immediate disqualification.",
      "All projects must be submitted within the designated time frame through the provided platform. Functional projects meeting specified requirements are necessary for evaluation.",
      "Projects will be evaluated on innovation, functionality, technical implementation, potential impact, and the quality of the presentation.",
      "The winning project may be eligible for a patent, and top teams will receive cash prizes. All participants will get certificates of participation.",
      "Teams can be disqualified for submitting copied code, disruptive behavior, or violating any event rules. Participants must bring their own hardware and adhere to the schedule."
    ],
    "contactPerson": [
      {
        "name": "Gadipelly Sandeep Kumar",
        "phone": "+91 9963787818"
      },
      {
        "name": "Kunal Meshram",
        "phone": "+91 9755365169"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSfnbH3wUHDQ-wU-i7kG0WDbPyTdeNjtb7eyXRpufkjVgVrwzQ/viewform"
  },
  {
    "name": "Code Quest",
    "description": "CodeQuest is an adventure-themed quiz where participants embark on a journey through various realms of computer science and engineering. Each realm represents a different technical domain, and participants must answer questions to unlock the next realm and ultimately complete their quest.",
    "image": "event posters/Technical/Capture the flag UPDATED_.png",
    "date": "26th September 2024",
    "time": "09:00 AM - 03:00 PM",
    "venue": "TBA",
    "fee": "₹120/- for a team of 2 participants, ₹180/- for a team of 3 participants, ₹220/- for a team of 4 participants",
    "rules": [
      "The event is open to all students, allowing teams of two to four members.",
      "The event will be offline with three coding rounds: code completion, error spotting, and writing code for a problem statement.",
      "Participants must bring their laptops and adhere to time limits for each round, with increasing difficulty in problems across rounds.",
      "Plagiarism, code copying, or seeking unauthorized help is strictly prohibited, leading to immediate disqualification.",
      "Problem statements for each round will be provided, and participants must use specified programming languages to solve them.",
      "Submissions must be error-free and submitted through the designated platform. Late submissions are only accepted for organizer-acknowledged technical issues.",
      "Solutions are judged based on correctness, efficiency, code readability, and innovation, with bonus points for optimized solutions."
    ],
    "contactPerson": [
      {
        "name": "Srijan Mani Tripathi",
        "phone": "+91 7903385276"
      },
      {
        "name": "Athish Krithik JD",
        "phone": "+91 9500476719"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSfduxmprmtHD2WTKfm0G1iQ6_gTRz6AuW7IgIVpZniTmA1eaw/viewform"
  },
  {
    "name": "BGMI",
    "description": "BGMI is a popular online multiplayer video game that falls under the battle royale genre. This is a team event where participants can showcase their BGMI skills.",
    "image": "event posters/Gaming/bgmi.png",
    "date": "27th September 2024",
    "time": "09:00 AM - 11:00 AM",
    "venue": "TBA",
    "fee": "₹120/- for a team of 2 participants, ₹180/- for a team of 3 participants, ₹200/- for a team of 4 participants",
    "rules": [
      "Each team must have an appointed team captain/team representative. Only the captain is allowed to communicate with the organisers before, during or after the matches.",
      "The tournament organiser may change without prior notice any of the rules and regulations which seem necessary to ensure the success of the tournament. The tournament organiser’s decision is final.",
      "Teams need to be at the venue 30 minutes prior to the designated match start time for setup. The lobby will be created by the organisers.",
      "To avoid delays in the program of the event, delays caused by players (showing up late, leaving the tournament area without a stated reason, last-minute smoke or toilet break) will lead to sanctions for the entire team. 15 minutes and beyond Game will be forfeited.",
      "All participants and team managers are required to uphold the highest standards of fair play and sportsmanship. Any misbehaviour, breaking of rules, cheating or hacking will lead to disqualification.",
      "Round 1: One battle royale match, from which the top 4 teams will qualify for next round (TDM).",
      "Round 2: All the 4 selected teams will play 3 matches in (TDM) against their opponent, the team which wins 2 matches out of 3, are qualified for the finals.",
      "Final Round: The finalists playing this round will have 5 matches (TDM), the team which wins 3 matches out of 5 will be considered as the Final winner.",
      "The game must be pre-installed on the mobile.",
      "Maps in play: Erangel",
      "Game Mode: TPP"
    ],
    "contactPerson": [
      {
        "name": "Abhishek M",
        "phone": "+91 7559067389"
      },
      {
        "name": "Shravan Chumble",
        "phone": "+91 7823844791"
      }
    ],
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSeKrpI6kQeWq6TwF3gVpWme2zKsst_Ncgbj8wY0n6-B0j8EQg/viewform"
  }
]
